src/Catalogs/кфкПеречисленияСпецификации/кфкПеречисленияСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкПеречисленияСпецификации</name>
  <owners>Catalog.кфкСпецификации</owners>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>CatalogRef.кфкТипыЗначенийСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонфигурации</name>
    <type>
      <types>CatalogRef.Объекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Значения</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>31</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/кфкПеречисленияСпецификации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Создать.
// 
// Параметры:
//	Спецификация - СправочникСсылка.кфкПеречисленияСпецификации - Спецификация
//	ОбъектКонфигурации - СправочникСсылка.Объекты - Объект конфигурации
//	Наименование - Строка - Наименование перечисления
// 
// Возвращаемое значение:
//	СправочникСсылка.кфкПеречисленияСпецификации - Созданный элемент
Функция Создать(Спецификация, ОбъектКонфигурации, Наименование) Экспорт
	
	Объект = СоздатьЭлемент();
	Объект.Наименование = Наименование;
	Объект.ТипЗначения = Справочники.кфкТипыЗначенийСпецификации.Строка;
	Объект.ОбъектКонфигурации = ОбъектКонфигурации;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Справочник.Значения.Наименование ГДЕ Владелец = &Владелец И ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Владелец", ОбъектКонфигурации);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект.Значения.Добавить().Значение = Выборка.Наименование;
	КонецЦикла;
	
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
